BookCollection/app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
---
      def index
        @books = Book.order(:title)

INSERT INTO "books" ("title", "author", "genre", "price", "publishedDate") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "the Lightning Thief"], ["author", "Rick Riordan"], ["genre", "Fantasy"], ["price", "10.0"], ["publishedDate", "2020-10-08"]]
---
      def create
        @book = Book.new(book_params)

        if @book.save